app/controllers/movies_controller.rb

  def show
    @movie = Movie.find(params[:id])
---
SELECT "movies".* FROM "movies" WHERE "movies"."id" = ? LIMIT 1  [["id", "1"]]

  def update
    @movie = Movie.find(params[:id])
    if @movie.update(movie_params)
---
SELECT "movies".* FROM "movies" WHERE "movies"."id" = ? LIMIT 1  [["id", "5"]]
UPDATE "movies" SET "image_file_name" = ?, "updated_at" = ? WHERE "movies"."id" = 7  [["image_file_name", "sherlock.jpg"], ["updated_at", Tue, 04 Nov 2014 00:21:52 UTC +00:00]]

  def create
    @movie = Movie.new(movie_params)
    if @movie.save
---
INSERT INTO "movies" ("cast", "created_at", "description", "director", "duration", "image_content_type", "image_file_name", "image_file_size", "image_updated_at", "rating", "released_on", "title", "total_gross", "updated_at") VALUES (?, ?, ?, ?, ?, ?, ?, ?, ?, ?, ?, ?, ?, ?)