app/controllers/reviews_controller.rb

	def create
		@review = @movie.reviews.new(review_params)
		if @review.save
---
INSERT INTO "reviews" ("comment", "created_at", "movie_id", "name", "stars", "updated_at") VALUES (?, ?, ?, ?, ?, ?)

	def edit
		@review = @movie.reviews.find(params[:id])
---
SELECT "reviews".* FROM "reviews" WHERE "reviews"."movie_id" = ? AND "reviews"."id" = ? LIMIT 1  [["movie_id", 6], ["id", "4"]]

	def update
		@review = @movie.reviews.find(params[:id])
		if @review.update(review_params)
---
SELECT "reviews".* FROM "reviews" WHERE "reviews"."movie_id" = ? AND "reviews"."id" = ? LIMIT 1  [["movie_id", 6], ["id", "4"]]
UPDATE "reviews" SET "stars" = ?, "updated_at" = ? WHERE "reviews"."id" = 4  [["stars", 4], ["updated_at", Tue, 04 Nov 2014 23:57:05 UTC +00:00]]

	def destroy
    	@review = @movie.reviews.find(params[:id])
    	@review.destroy
---
SELECT "reviews".* FROM "reviews" WHERE "reviews"."movie_id" = ? AND "reviews"."id" = ? LIMIT 1  [["movie_id", 6], ["id", "10"]]
DELETE FROM "reviews" WHERE "reviews"."id" = ?  [["id", 10]]